In [26]:
import xlrd
import csv
import pandas as pd

Let's look where we are located... This way we make sure we are in the directory where the Excel sheet was saved.

In [121]:
%pwd

'C:\\Users\\Skenny02\\Documents\\Python Scripts'

## Below we wil be opening the Excel sheet "sharon.xls" to find out the name of the sheets.

In [122]:
xl = pd.ExcelFile('sharon.xls')
sh_list = xl.sheet_names
sh_name = sh_list[0]
sh_name

'vale'

### Now we will open the sheet we have selected ...

In [123]:
data_xls = pd.read_excel('sharon.xls', 'vale', index_col=False)
data_xls

     name  name.1 last_name
0  autumn  autumn     kenny

In [124]:
# then we make the column name to be the index
df1 = data_xls.set_index('name')
df1

        name.1 last_name
name
autumn  autumn     kenny

Do we save now the Excel sheet?

We need to copy a whole column into another table.  Let's place the "vale" column of df1 into another Excel sheet called

Let's bring another table into the picture

In [150]:
df2 = pd.read_csv("norway.csv", sep=",", index_col=0)

print(list(df2.columns.values))
df2

['age', 'happyness']

        age happyness
name
remi      5  svalbard
autumn    9    tromso
emmi      1      PoCo

In [195]:
#df1 = df1.reset_index(drop=True)
#df2 = df2.reset_index(drop=True)
df5 = pd.concat([df1, df2], axis=1)
df5

        name.1 last_name  age happyness
autumn  autumn     kenny    9    tromso
emmi       NaN       NaN    1      PoCo
remi       NaN       NaN    5  svalbard

In [191]:
data = {"name":["ad", "ktk8", 'autumn', "mommom", "poppop"], 
         "favorite":['crimson', 'blue', 'purple', 'sky','green']}
fd4 = pd.DataFrame(data)
fd4

  favorite    name
0  crimson      ad
1     blue    ktk8
2   purple  autumn
3      sky  mommom
4    green  poppop

In [193]:
gg = fd4.set_index('name')
print(list(fd4.columns.values))
gg

['favorite', 'name']

       favorite
name
ad      crimson
ktk8       blue
autumn   purple
mommom      sky
poppop    green

In [196]:
finished = pd.concat([df5, gg], axis=1)
finished

        name.1 last_name  age happyness favorite
ad         NaN       NaN  NaN       NaN  crimson
autumn  autumn     kenny  9.0    tromso   purple
emmi       NaN       NaN  1.0      PoCo      NaN
ktk8       NaN       NaN  NaN       NaN     blue
mommom     NaN       NaN  NaN       NaN      sky
poppop     NaN       NaN  NaN       NaN    green
remi       NaN       NaN  5.0  svalbard      NaN

In [207]:
writer = pd.ExcelWriter('output3.xls')
finished.to_excel(writer,'total_yes')
writer.save()

In [208]:
!dir

 Volume in drive C is OSDisk
 Volume Serial Number is 5E86-D718

 Directory of C:\Users\Skenny02\Documents\Python Scripts

08/27/2018  10:14 PM    <DIR>          .
08/27/2018  10:14 PM    <DIR>          ..
08/27/2018  05:08 PM    <DIR>          .ipynb_checkpoints
08/27/2018  05:07 PM            29,807 Excel2CSV.ipynb
08/27/2018  01:12 PM                50 happyPySDK.py
08/27/2018  01:12 PM                65 norway.csv
08/27/2018  10:13 PM             5,632 output.xls
08/27/2018  09:53 PM             5,088 output.xlsx
08/27/2018  09:55 PM             5,632 output2.xls
08/27/2018  10:15 PM             5,632 output3.xls
08/27/2018  10:14 PM            20,907 Pandas_ImportingColumns.ipynb
08/27/2018  04:56 PM                14 potato.csv
08/27/2018  04:32 PM                33 shar.csv
08/27/2018  09:19 PM            26,112 sharon.xls
08/27/2018  01:12 PM            14,230 Tricks_in_JupyNotes.ipynb
              12 File(s)        113,202 bytes
               3 Dir(s)  52,213,424,128 bytes free

In [209]:
out = pd.read_excel('output3.xls')

In [210]:
out

        name.1 last_name  age happyness favorite
ad         NaN       NaN  NaN       NaN  crimson
autumn  autumn     kenny  9.0    tromso   purple
emmi       NaN       NaN  1.0      PoCo      NaN
ktk8       NaN       NaN  NaN       NaN     blue
mommom     NaN       NaN  NaN       NaN      sky
poppop     NaN       NaN  NaN       NaN    green
remi       NaN       NaN  5.0  svalbard      NaN